### Imports and Settings

In [1]:
from sqlalchemy import create_engine
import pymysql
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Obtain Raw Data  
The Credit One customer data is on the MySQL sever. So in this stage I have to connect to the server, query the database for the customer data, and set it up as a Pandas dataframe, and then export the raw data as a .csv file.

## Connect to MySQL & Query Database

In [2]:
#connect python to MySQL server (database?)
db_connection_str = 'mysql+pymysql://deepanalytics:Sqltask1234!@34.73.222.197/deepanalytics'

In [3]:
#create engine for SQLalchemy to interface with the database API (see notes below)
db_connection = create_engine(db_connection_str)

# first time successfully queried db without this line, so not entirely
#sure why it is needed. asked on slack, answer = link to oriely article

In [4]:
#query the credit one data and extract it into a pd df
sql_query = pd.read_sql('SELECT * FROM credit', con=db_connection)

In [5]:
#create pandas df from SQL query
df = pd.DataFrame(sql_query)

*Notes*
* First time through the exercise, I missed the ```db_connection = create_engine(db_connection_str)``` line. i got a name error b/c 'db_connection' was not defined. so i removed the _str from the first line, ran the cells, and was able to execute the query in my notebook. So ultimately, I'm unsure why we need the create_engine code. (see my SQL collection in edge for some explanatory links)
* in the course outline, they did not have us use ```pd.DataFrame()```. They just told us to create the df from ```df = pd.read_sql()```. I suspect that was an oversight.
* I made the slight changes you see following a tutorial I found on how to export a SQL query as a csv file.

## Verify Proper Extraction

In [6]:
df.head()

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30204 entries, 0 to 30203
Data columns (total 25 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   MyUnknownColumn  30204 non-null  object
 1   X1               30204 non-null  object
 2   X2               30204 non-null  object
 3   X3               30204 non-null  object
 4   X4               30204 non-null  object
 5   X5               30204 non-null  object
 6   X6               30204 non-null  object
 7   X7               30204 non-null  object
 8   X8               30204 non-null  object
 9   X9               30204 non-null  object
 10  X10              30204 non-null  object
 11  X11              30204 non-null  object
 12  X12              30204 non-null  object
 13  X13              30204 non-null  object
 14  X14              30204 non-null  object
 15  X15              30204 non-null  object
 16  X16              30204 non-null  object
 17  X17              30204 non-null  object
 18  X18              30204 non-null  object
 19  X19              30204 non-null  object
 20  X20              30204 non-null  object
 21  X21              30204 non-null  object
 22  X22              30204 non-null  object
 23  X23              30204 non-null  object
 24  Y                30204 non-null  object
dtypes: object(25)
memory usage: 5.8+ MB

## Export Raw Data As CSV File

In [8]:
#export df as .csv file
df.to_csv (r'C:\Users\Kpiat\export_data.csv', index = False)

*Notes*  

* This data is from a paper published in Expert Systems with Applications found [here](https://bradzzz.gitbooks.io/ga-seattle-dsi/content/dsi/dsi_05_classification_databases/2.1-lesson/assets/datasets/DefaultCreditCardClients_yeh_2009.pdf)
* A short summary of project and description of variables is in PDF in course 2 folder.
* Dataframe Characteristics: 26 columns—23 features/independent variables, 1 dependent variable, column 0 = ID, and 30,204 rows 
* Initial Cleaning Tasks:
1. Reset column headings/names to strings in row 0 
2. Delete row 0 from the dataframe.
3. Change dtypes for variables for object to appropriate type
4. First 200+ rows may be duplicates, investigate furthur.

---

# Process Raw Data

In [9]:
#import exported csv file with raw data
df = pd.read_csv('raw_credit_one_data.csv')

In [10]:
#verify imported data looks as expected 
df.head()

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default

In [11]:
#look at number of rows and columns in df as benchmark before making any changes 
df.shape

(30204, 25)

## Change Column Headings

In [12]:
#change column headings to values in index (row) 0 
df.columns = df.iloc[0]

In [13]:
#verify change was successful
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default

In [14]:
#drop row 0 that contains column headings
df.drop(df.index[0], inplace = True)

In [15]:
#verify df is -1 row
len(df)

30203

In [16]:
#verify column headings row was dropped
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
5,5,50000,male,university,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default

*Notes*
* Found how to do this on [Stack Overflow](https://stackoverflow.com/questions/26147180/convert-row-to-column-header-for-pandas-dataframe).
* ```df.iloc[pd.RangeIndex(len(df)).drop(0)]``` is for situations where your df does not have or you don't know if it has unique index numbers for each row. If you know all index numbers are unique, you can use ```df.drop(df.index[0])```.
* I choose non-unique method because I'm unsure what the situation is. 

***♠ Why is the 0 index missing? I thought df.drop would drop data from index 0 and replace it with values that used to be in index 1.***

In [17]:
df.loc[200:206]

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
200,200,30000,female,high school,2,22,1,2,2,0,...,29836,1630,0,1000,85,1714,104,0,0,default
201,201,180000,female,graduate school,1,38,-2,-2,-2,-2,...,0,0,0,0,0,0,0,0,0,not default
202,NaN,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
203,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
204,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
205,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
206,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default

## Wrangle Duplicate Data

***♠ How do we look for duplicate columns? Do we need to do that? How would we drop duplicate columns?***

### Duplicate Rows

In [18]:
#find and print all duplicate rows in the df
duplicate_rows = df[df.duplicated()]
print(duplicate_rows)

0     ID LIMIT_BAL     SEX        EDUCATION MARRIAGE AGE PAY_0 PAY_2 PAY_3  \
204    1     20000  female       university        1  24     2     2    -1
205    2    120000  female       university        2  26    -1     2     0
206    3     90000  female       university        2  34     0     0     0
207    4     50000  female       university        1  37     0     0     0
208    5     50000    male       university        1  57    -1     0    -1
..   ...       ...     ...              ...      ...  ..   ...   ...   ...
400  197    150000  female       university        1  34    -2    -2    -2
401  198     20000  female  graduate school        2  22     0     0     0
402  199    500000  female  graduate school        1  34    -2    -2    -2
403  200     30000  female      high school        2  22     1     2     2
404  201    180000  female  graduate school        1  38    -2    -2    -2

0   PAY_4  ... BILL_AMT4 BILL_AMT5 BILL_AMT6 PAY_AMT1 PAY_AMT2 PAY_AMT3  \
204    -1  ...         0         0         0        0      689        0
205     0  ...      3272      3455      3261        0     1000     1000
206     0  ...     14331     14948     15549     1518     1500     1000
207     0  ...     28314     28959     29547     2000     2019     1200
208     0  ...     20940     19146     19131     2000    36681    10000
..    ...  ...       ...       ...       ...      ...      ...      ...
400    -2  ...       116         0      1500        0        0      116
401     0  ...      8332     18868     19247     1500     1032      541
402    -1  ...      1251      1206      1151      138     2299     1251
403     0  ...     29836      1630         0     1000       85     1714
404    -2  ...         0         0         0        0        0        0

0   PAY_AMT4 PAY_AMT5 PAY_AMT6 default payment next month
204        0        0        0                    default
205     1000        0     2000                    default
206     1000     1000     5000                not default
207     1100     1069     1000                not default
208     9000      689      679                not default
..       ...      ...      ...                        ...
400        0     1500        0                not default
401    20000      693     1000                not default
402     1206     1151    15816                not default
403      104        0        0                    default
404        0        0        0                not default

[201 rows x 25 columns]

In [19]:
#drop duplicate rows from the df
df.drop_duplicates(inplace = True)  #inplace=True is to make change to df permanent

In [20]:
#verify rows were dropped
len(df)

30002

## Missing Data

In [21]:
#check for missing values
print(df.isnull().sum())

0
ID                            1
LIMIT_BAL                     0
SEX                           0
EDUCATION                     0
MARRIAGE                      0
AGE                           0
PAY_0                         0
PAY_2                         0
PAY_3                         0
PAY_4                         0
PAY_5                         0
PAY_6                         0
BILL_AMT1                     0
BILL_AMT2                     0
BILL_AMT3                     0
BILL_AMT4                     0
BILL_AMT5                     0
BILL_AMT6                     0
PAY_AMT1                      0
PAY_AMT2                      0
PAY_AMT3                      0
PAY_AMT4                      0
PAY_AMT5                      0
PAY_AMT6                      0
default payment next month    0
dtype: int64

*Notes*
* There appears to be one one missing data point in the ID var.
* However, I'm not sure running ```df.isnull()``` is enough to check for that.

In [22]:
#drop the row with missing ID
df.dropna(inplace=True)

In [23]:
len(df)

30001

---

## Invaild Data

In [24]:
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
5,5,50000,male,university,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default

In [25]:
#locate rows 201-206 (not inclusive)
df.loc[201:206]

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
201,201,180000,female,graduate school,1,38,-2,-2,-2,-2,...,0,0,0,0,0,0,0,0,0,not default
203,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month

In [26]:
#drop row 203 containing original column headings
df.drop(203, inplace=True)

In [27]:
len(df)

30000

In [28]:
df.loc[201:210] #only row 201 should appear b/c others were dropped above

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
201,201,180000,female,graduate school,1,38,-2,-2,-2,-2,...,0,0,0,0,0,0,0,0,0,not default

*Notes*
* deleting column headings row and duplicate rows took many tries.
    * First problem, I didn't know that dropping rows doesn't stick unless you add an inplace = True parameter to your code. 
    * Second problem, I didn't realize that after you drop an index from the df (and stick it) that the index number dropped no longer appears in the df (e.g. if you drop index 0, when you use df.head() the first entry will be index 1). In other words, the data from below does not move up and fill the dropped indices as it would in an Excel file. 
* After I noticed the drops weren't sticking, I tried to solve the problem by naming a new df and setting that = to the df.drop_duplicated. That was unsuccessful. 
* Lavana advised me to add an 'inplace=True' parameter to all my drop commands. [this](https://stackabuse.com/python-with-pandas-dataframe-tutorial-with-examples/) helped me understand why that parameter is needed.
* I found this code on a tutorial to find non-numeric data in a column ```non_numeric_limit = df.LIMIT_BAL.str.contains('[^0-9.-]') / df.loc[non_numeric_limit].head()```
---

## Re-set Data Types of Variables

In [29]:
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
5,5,50000,male,university,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default

In [30]:
#look at data types for each variable
df.dtypes

0
ID                            object
LIMIT_BAL                     object
SEX                           object
EDUCATION                     object
MARRIAGE                      object
AGE                           object
PAY_0                         object
PAY_2                         object
PAY_3                         object
PAY_4                         object
PAY_5                         object
PAY_6                         object
BILL_AMT1                     object
BILL_AMT2                     object
BILL_AMT3                     object
BILL_AMT4                     object
BILL_AMT5                     object
BILL_AMT6                     object
PAY_AMT1                      object
PAY_AMT2                      object
PAY_AMT3                      object
PAY_AMT4                      object
PAY_AMT5                      object
PAY_AMT6                      object
default payment next month    object
dtype: object

*Notes*
* I thought after dropping all non-numerical values from the df, the vars with numerical values would change to int64 or float64. They did not. Ben said data types will need to be changed manually.

### Variables with Integer Values

In [31]:
df.LIMIT_BAL.value_counts()

50000      3365
20000      1976
30000      1610
80000      1567
200000     1528
           ...
16000         2
760000        1
690000        1
327680        1
1000000       1
Name: LIMIT_BAL, Length: 81, dtype: int64

In [32]:
non_numeric_limit = df.LIMIT_BAL.str.contains('[^0-9.-]') 
df.loc[non_numeric_limit].head()

Empty DataFrame
Columns: [ID, LIMIT_BAL, SEX, EDUCATION, MARRIAGE, AGE, PAY_0, PAY_2, PAY_3, PAY_4, PAY_5, PAY_6, BILL_AMT1, BILL_AMT2, BILL_AMT3, BILL_AMT4, BILL_AMT5, BILL_AMT6, PAY_AMT1, PAY_AMT2, PAY_AMT3, PAY_AMT4, PAY_AMT5, PAY_AMT6, default payment next month]
Index: []

[0 rows x 25 columns]

In [33]:
#change data type of LIMIT_BAL var from object to int
df["LIMIT_BAL"] = df['LIMIT_BAL'].astype('int')

In [34]:
df.AGE.value_counts()

29    1605
27    1477
28    1409
30    1395
26    1256
31    1217
25    1186
34    1162
32    1158
33    1146
24    1127
35    1113
36    1108
37    1041
39     954
38     944
23     931
40     870
41     824
42     794
44     700
43     670
45     617
46     570
22     560
47     501
48     466
49     452
50     411
51     340
53     325
52     304
54     247
55     209
56     178
58     122
57     122
59      83
21      67
60      67
61      56
62      44
64      31
63      31
66      25
65      24
67      16
69      15
70      10
68       5
73       4
72       3
71       3
75       3
79       1
74       1
Name: AGE, dtype: int64

In [35]:
#change data type of AGE var from object to int
df["AGE"] = df['AGE'].astype('int')

In [36]:
df.PAY_0.value_counts()

0     14737
-1     5686
1      3688
-2     2759
2      2667
3       322
4        76
5        26
8        19
6        11
7         9
Name: PAY_0, dtype: int64

In [37]:
df.PAY_4.value_counts()

0     16455
-1     5687
-2     4348
2      3159
3       180
4        69
7        58
5        35
6         5
8         2
1         2
Name: PAY_4, dtype: int64

In [38]:
df.BILL_AMT1.value_counts()

0         2008
390        244
780         76
326         72
316         63
          ...
119884       1
92129        1
160832       1
10695        1
49302        1
Name: BILL_AMT1, Length: 22723, dtype: int64

In [39]:
#change data type of BILL_AMT1 var from object to int
df["BILL_AMT1"] = df['BILL_AMT1'].astype('int')

In [40]:
#change data type of BILL_AMT2 var from object to int
df["BILL_AMT2"] = df['BILL_AMT2'].astype('int')

In [41]:
#change data type of BILL_AMT3 var from object to int
df["BILL_AMT3"] = df['BILL_AMT3'].astype('int')

In [42]:
#change data type of BILL_AMT4 var from object to int
df["BILL_AMT4"] = df['BILL_AMT4'].astype('int')

In [43]:
#change data type of BILL_AMT5 var from object to int
df["BILL_AMT5"] = df['BILL_AMT5'].astype('int')

In [44]:
#change data type of BILL_AMT6 var from object to int
df["BILL_AMT6"] = df['BILL_AMT6'].astype('int')

In [45]:
df.PAY_AMT4.value_counts()

0        6408
1000     1394
2000     1214
3000      887
5000      810
         ...
2599        1
2562        1
15121       1
7407        1
29160       1
Name: PAY_AMT4, Length: 6937, dtype: int64

In [46]:
#change data type of PAY_AMT1 var from object to int
df["PAY_AMT1"] = df['PAY_AMT1'].astype('int')

In [47]:
#change data type of PAY_AMT2 var from object to int
df["PAY_AMT2"] = df['PAY_AMT2'].astype('int')

In [48]:
#change data type of PAY_AMT3 var from object to int
df["PAY_AMT3"] = df['PAY_AMT3'].astype('int')

In [49]:
#change data type of PAY_AMT4 var from object to int
df["PAY_AMT4"] = df['PAY_AMT4'].astype('int')

In [50]:
#change data type of PAY_AMT5 var from object to int
df["PAY_AMT5"] = df['PAY_AMT5'].astype('int')

In [51]:
#change data type of PAY_AMT6 var from object to int
df["PAY_AMT6"] = df['PAY_AMT6'].astype('int')

In [52]:
#rename default payment next month column
df.rename(columns={"default payment next month": "DEFAULT"}, inplace = True)

In [53]:
#verify changes were made
df.dtypes

0
ID           object
LIMIT_BAL     int32
SEX          object
EDUCATION    object
MARRIAGE     object
AGE           int32
PAY_0        object
PAY_2        object
PAY_3        object
PAY_4        object
PAY_5        object
PAY_6        object
BILL_AMT1     int32
BILL_AMT2     int32
BILL_AMT3     int32
BILL_AMT4     int32
BILL_AMT5     int32
BILL_AMT6     int32
PAY_AMT1      int32
PAY_AMT2      int32
PAY_AMT3      int32
PAY_AMT4      int32
PAY_AMT5      int32
PAY_AMT6      int32
DEFAULT      object
dtype: object

### Categorical Variables

In [54]:
df.SEX.value_counts()

female    18112
male      11888
Name: SEX, dtype: int64

In [55]:
df.EDUCATION.value_counts()

university         14030
graduate school    10585
high school         4917
other                468
Name: EDUCATION, dtype: int64

In [56]:
df.MARRIAGE.value_counts()

2    15964
1    13659
3      323
0       54
Name: MARRIAGE, dtype: int64

In [57]:
df.PAY_0.value_counts()

0     14737
-1     5686
1      3688
-2     2759
2      2667
3       322
4        76
5        26
8        19
6        11
7         9
Name: PAY_0, dtype: int64

In [58]:
df.DEFAULT.value_counts()

not default    23364
default         6636
Name: DEFAULT, dtype: int64

In [ ]:
#view histograms of each var in the dataframe
plt.subplots(figsize = (17, 17))

plt.subplot(5,5,1)
plt.hist(df['LIMIT_BAL'])
plt.title('LIMIT_BAL')

plt.subplot(5,5,2)
plt.hist(df['SEX'])
plt.title('SEX')

plt.subplot(5,5,3)
plt.hist(df['EDUCATION'])
plt.title('EDU')

plt.subplot(5,5,4)
plt.hist(df['MARRIAGE'])
plt.title('MARRIAGE')

plt.subplot(5,5,5)
plt.hist(df['AGE'])
plt.title('AGE')

plt.subplot(5,5,6)
plt.hist(df['PAY_0'])
plt.title('PAY_0')

plt.subplot(5,5,7)
plt.hist(df['PAY_2'])
plt.title('PAY_2')

plt.subplot(5,5,8)
plt.hist(df['PAY_3'])
plt.title('PAY_3')

"""
#view histograms of each var in the dataframe
plt.subplots(figsize = (17, 17))


plt.subplot(5,5,1)
plt.hist(df['BILL_AMT1'])
plt.title('BILL_AMT1')

plt.subplot(5,5,2)
plt.hist(df['BILL_AMT2'])
plt.title('BILL_AMT2')

plt.subplot(5,5,3)
plt.hist(df['BILL_AMT3'])
plt.title('BILL_AMT3')

plt.subplot(5,5,4)
plt.hist(df['PAY_AMT1'])
plt.title('PAY_AMT1')

plt.subplot(5,5,5)
plt.hist(df['PAY_AMT2'])
plt.title('PAY_AMT2')

plt.subplot(5,5,6)
plt.hist(df['PAY_AMT3'])
plt.title('PAY_AMT3')
""""""